Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ2051CA91100.svd
            <register>
               <name>PEFTSH</name>
               <description>PTP Peer Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0x10F0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFRSH</name>
               <description>PTP Peer Event Frame Received Seconds High Register</description>
               <addressOffset>0x10F4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPRAMFD</name>
               <description>TX and RX packet buffer fill levels</description>
               <addressOffset>0x10F8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXRXSEL</name>
                     <description>TX/RX Fill Level Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRXQSEL</name>
                     <description>TX/RX Fill Level Queue Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXRXLVL</name>
                     <description>TX/RX Buffer Fill Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REVREG</name>
               <description>TX and RX packet buffer fill levels</description>
               <addressOffset>0x10FC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MR</name>
                     <description>Module Revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MID</name>
                     <description>Module Identification</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>FN</name>
                     <description>Fix Number</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTLO</name>
               <description>Octets Transmitted [31:0] Register</description>
               <addressOffset>0x1100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTHI</name>
               <description>Octets Transmitted [47:32] Register</description>
               <addressOffset>0x1104</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FT</name>
               <description>Frames Transmitted Register</description>
               <addressOffset>0x1108</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FTX</name>
                     <description>Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCFT</name>
               <description>Broadcast Frames Transmitted Register</description>
               <addressOffset>0x110C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BFTX</name>
                     <description>Broadcast Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MFT</name>
               <description>Multicast Frames Transmitted Register</description>
               <addressOffset>0x1110</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MFTX</name>
                     <description>Multicast Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFT</name>
               <description>Pause Frames Transmitted Register</description>
               <addressOffset>0x1114</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PFTX</name>
                     <description>Pause Frames Transmitted Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFT64</name>
               <description>64 Byte Frames Transmitted Register</description>
               <addressOffset>0x1118</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>64 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT127</name>
               <description>65 to 127 Byte Frames Transmitted Register</description>
               <addressOffset>0x111C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>65 to 127 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT255</name>
               <description>128 to 255 Byte Frames Transmitted Register</description>
               <addressOffset>0x1120</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>128 to 255 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT511</name>
               <description>256 to 511 Byte Frames Transmitted Register</description>
               <addressOffset>0x1124</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>256 to 511 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT1023</name>
               <description>512 to 1023 Byte Frames Transmitted Register</description>
               <addressOffset>0x1128</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>512 to 1023 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT1518</name>
               <description>1024 to 1518 Byte Frames Transmitted Register</description>
               <addressOffset>0x112C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>1024 to 1518 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GTBFT1518</name>
               <description>Greater Than 1518 Byte Frames Transmitted Register</description>
               <addressOffset>0x1130</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>Greater than 1518 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TUR</name>
               <description>Transmit Underruns Register</description>
               <addressOffset>0x1134</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXUNR</name>
                     <description>Transmit Underruns</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCF</name>
               <description>Single Collision Frames Register</description>
               <addressOffset>0x1138</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCOL</name>
                     <description>Single Collision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCF</name>
               <description>Multiple Collision Frames Register</description>
               <addressOffset>0x113C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCOL</name>
                     <description>Multiple Collision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC</name>
               <description>Excessive Collisions Register</description>
               <addressOffset>0x1140</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XCOL</name>
                     <description>Excessive Collisions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LC</name>
               <description>Late Collisions Register</description>
               <addressOffset>0x1144</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LCOL</name>
                     <description>Late Collisions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTF</name>
               <description>Deferred Transmission Frames Register</description>
               <addressOffset>0x1148</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DEFT</name>
                     <description>Deferred Transmission</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSE</name>
               <description>Carrier Sense Errors Register</description>
               <addressOffset>0x114C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR</name>
                     <description>Carrier Sense Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ORLO</name>
               <description>Octets Received [31:0] Received</description>
               <addressOffset>0x1150</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXO</name>
                     <description>Received Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ORHI</name>
               <description>Octets Received [47:32] Received</description>
               <addressOffset>0x1154</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXO</name>
                     <description>Received Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FR</name>
               <description>Frames Received Register</description>
               <addressOffset>0x1158</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FRX</name>
                     <description>Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCFR</name>
               <description>Broadcast Frames Received Register</description>
               <addressOffset>0x115C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BFRX</name>
                     <description>Broadcast Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MFR</name>
               <description>Multicast Frames Received Register</description>
               <addressOffset>0x1160</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MFRX</name>
                     <description>Multicast Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFR</name>
               <description>Pause Frames Received Register</description>
               <addressOffset>0x1164</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PFRX</name>
                     <description>Pause Frames Received Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFR64</name>
               <description>64 Byte Frames Received Register</description>
               <addressOffset>0x1168</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>64 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR127</name>
               <description>65 to 127 Byte Frames Received Register</description>
               <addressOffset>0x116C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>65 to 127 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR255</name>
               <description>128 to 255 Byte Frames Received Register</description>
               <addressOffset>0x1170</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>128 to 255 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR511</name>
               <description>256 to 511Byte Frames Received Register</description>
               <addressOffset>0x1174</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>256 to 511 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR1023</name>
               <description>512 to 1023 Byte Frames Received Register</description>
               <addressOffset>0x1178</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>512 to 1023 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR1518</name>
               <description>1024 to 1518 Byte Frames Received Register</description>
               <addressOffset>0x117C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>1024 to 1518 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMXBFR</name>
               <description>1519 to Maximum Byte Frames Received Register</description>
               <addressOffset>0x1180</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>1519 to Maximum Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
